config/gptel/scope/scope-expansion.org
#+title: GPTEL Scope Expansion UI
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle scope-expansion.el
#+auto_tangle: y

* Overview

This module provides an interactive UI for handling scope violations in gptel sessions.
When a tool attempts to access a resource outside its allowed scope, the user is
presented with three options via a transient menu:

1. **Deny** - Reject the tool call and return an error to the LLM
2. **Add to scope** - Update the chat buffer's =:PROPERTIES:= drawer permanently to allow this resource
3. **Allow once** - Temporarily allow for the current LLM response only

* Lexical Binding

#+begin_src emacs-lisp :comments no
;;; scope-expansion.el --- GPTEL Scope Expansion UI -*- lexical-binding: t; -*-

;; Copyright (C) 2024-2026 Jeff Farr

;;; Commentary:

;; Interactive UI for handling scope violations with 3-choice menu.

;;; Code:

(require 'cl-lib)
(require 'org)
(require 'transient)
(require 'jf-gptel-scope-validation)
#+end_src

* State Management

Transient scope mechanism is used to pass violation info and callbacks to suffix commands.
See transient-tools.org for detailed architecture documentation.

** Expansion Queue

When gptel fires multiple async tools via =mapc=, more than one may trigger the expansion UI.
Since transient is single-instance (=transient-setup= replaces any active transient's scope),
calling it twice would lose the first callback. The queue serializes prompts:

1. First call → no active expansion → show transient, set active flag
2. Second call → active expansion → push to queue
3. User responds to first → invoke callback → pop queue → show next transient
4. User responds to second → invoke callback → queue empty → clear active flag

#+begin_src emacs-lisp
(defvar-local jf/gptel-scope--expansion-queue nil
  "Queue of pending expansion prompts waiting to be shown.
Each entry is a plist with :violation, :callback, :patterns, :tool-name,
:chat-buffer.  Buffer-local so concurrent gptel sessions don't interfere.")

(defvar-local jf/gptel-scope--expansion-active nil
  "Non-nil when an expansion transient menu is currently displayed.
Used to decide whether to show transient immediately or queue.")

(defun jf/gptel-scope--process-expansion-queue ()
  "Process the next queued expansion prompt, or clear the active flag.
Called after each transient suffix action (deny, allow-once, add-to-scope).
If queue has items, pops the next and shows its transient.
If queue is empty, clears the active flag."
  (if jf/gptel-scope--expansion-queue
      ;; Pop next item and show transient
      (let* ((next (pop jf/gptel-scope--expansion-queue))
             (violation (plist-get next :violation))
             (callback (plist-get next :callback))
             (patterns (plist-get next :patterns))
             (tool-name (plist-get next :tool-name))
             (chat-buffer (plist-get next :chat-buffer)))
        (transient-setup 'jf/gptel-scope-expansion-menu nil nil
                         :scope (list :violation violation
                                      :callback callback
                                      :patterns patterns
                                      :tool-name tool-name
                                      :chat-buffer chat-buffer)))
    ;; Queue empty — clear active flag
    (setq jf/gptel-scope--expansion-active nil)))
#+end_src

* Helper Functions

** Parent Wildcard For

#+begin_src emacs-lisp
(defun jf/gptel-scope--parent-wildcard-for (resource)
  "Return parent-directory wildcard pattern for a RESOURCE file path.
Examples: ~/foo/bar.txt → ~/foo/** | /a/b/src/init.el → /a/b/src/**"
  (concat (string-remove-suffix "/" (file-name-directory resource)) "/**"))
#+end_src

** Current Chat Buffer

The expansion handlers mutate the chat buffer's =:PROPERTIES:= drawer. The
chat buffer is captured at expansion-trigger time and stored on the
transient scope under =:chat-buffer=. This helper retrieves it and falls
back to =(current-buffer)= for callers that haven't been updated yet.
Returns =nil= when there is no live chat buffer to mutate.

#+begin_src emacs-lisp
(defun jf/gptel-scope--current-chat-buffer ()
  "Return the chat buffer associated with the active expansion, or nil.
Reads `:chat-buffer' from the transient scope plist captured at
expansion-trigger time. Falls back to `(current-buffer)' when no transient
scope is available (defensive — production callers always go through the
transient).  Returns nil when the captured buffer has been killed."
  (let* ((scope (and (fboundp 'transient-scope) (transient-scope)))
         (buffer (or (and scope (plist-get scope :chat-buffer))
                     (current-buffer))))
    (and (bufferp buffer) (buffer-live-p buffer) buffer)))
#+end_src

** Write Pattern to Scope

Shared routing helper extracted from =jf/gptel-scope--add-to-scope=.
Encapsulates the =pcase= routing block so it can be reused by wildcard and
custom suffix commands.  The =bash= validation type still has a path-vs-
bare-command branch in =--add-bash-to-scope= (bare command names are not
expandable in the operation-first model).

#+begin_src emacs-lisp
(defun jf/gptel-scope--write-pattern-to-scope (pattern validation-type tool denied-operation)
  "Route PATTERN to the drawer writer based on VALIDATION-TYPE.
TOOL is the tool name (passed for diagnostic context only).
DENIED-OPERATION is the operation keyword from the validation error
(e.g. :read, :write) collapsed by the writer to the matching drawer key
via `jf/gptel-scope--map-operation-to-drawer-key'.

Returns the result of the underlying drawer writer (the pattern string
when the buffer was modified, nil on dedup short-circuit, or nil on the
bare-command branch of bash routing — see `--add-bash-to-scope')."
  (pcase validation-type
    ('path
     (jf/gptel-scope--add-path-to-scope pattern tool denied-operation))
    ('bash
     (jf/gptel-scope--add-bash-to-scope pattern tool denied-operation))
    (_
     (user-error "Unknown validation type: %s" validation-type))))
#+end_src

* Drawer Writer

The single canonical drawer mutator for the file-level =:PROPERTIES:= drawer.
Replaces the YAML mutator pipeline (parse → modify plist → re-emit YAML →
write file) with three stages:

1. *Operation → drawer-key collapse* — delegates to
   =jf/gptel-scope--map-operation-to-drawer-key=, the single closed-set
   mapping declared in =register/vocabulary/operation-to-drawer-key=.
2. *Dedup against existing values* — if =PATTERN= is already present under
   the target drawer key, the writer returns nil and does not mutate the
   buffer or call =save-buffer=. This is contractual idempotency
   (=register/invariant/scope-add-pattern-idempotent=), not an
   optimisation: the inline-flow trigger re-enters
   =jf/gptel-scope-authorize-tool-call= after each add-to-scope and a
   multi-violation tool call can pass through the same pattern twice on
   retry.
3. *=org-entry-put-multivalued-property= + =save-buffer=* — Org's standard
   multi-value writer keeps a single drawer at point-min
   (=register/invariant/scope-drawer-no-duplication=); =save-buffer=
   triggers chat-mode's existing before-save-hook chain.

These functions are landed unused; rewiring the expansion handlers to use
the writer happens in =rewire-expansion-writer=.

