config/gptel/scope/scope-expansion.el
;;; scope-expansion.el --- GPTEL Scope Expansion UI -*- lexical-binding: t; -*-

;; Copyright (C) 2024-2026 Jeff Farr

;;; Commentary:

;; Interactive UI for handling scope violations with 3-choice menu.

;;; Code:

(require 'cl-lib)
(require 'org)
(require 'transient)
(require 'jf-gptel-scope-validation)

(defvar-local jf/gptel-scope--expansion-queue nil
  "Queue of pending expansion prompts waiting to be shown.
Each entry is a plist with :violation, :callback, :patterns, :tool-name,
:chat-buffer.  Buffer-local so concurrent gptel sessions don't interfere.")

(defvar-local jf/gptel-scope--expansion-active nil
  "Non-nil when an expansion transient menu is currently displayed.
Used to decide whether to show transient immediately or queue.")

(defun jf/gptel-scope--process-expansion-queue ()
  "Process the next queued expansion prompt, or clear the active flag.
Called after each transient suffix action (deny, allow-once, add-to-scope).
If queue has items, pops the next and shows its transient.
If queue is empty, clears the active flag."
  (if jf/gptel-scope--expansion-queue
      ;; Pop next item and show transient
      (let* ((next (pop jf/gptel-scope--expansion-queue))
             (violation (plist-get next :violation))
             (callback (plist-get next :callback))
             (patterns (plist-get next :patterns))
             (tool-name (plist-get next :tool-name))
             (chat-buffer (plist-get next :chat-buffer)))
        (transient-setup 'jf/gptel-scope-expansion-menu nil nil
                         :scope (list :violation violation
                                      :callback callback
                                      :patterns patterns
                                      :tool-name tool-name
                                      :chat-buffer chat-buffer)))
    ;; Queue empty — clear active flag
    (setq jf/gptel-scope--expansion-active nil)))

(defun jf/gptel-scope--parent-wildcard-for (resource)
  "Return parent-directory wildcard pattern for a RESOURCE file path.
Examples: ~/foo/bar.txt → ~/foo/** | /a/b/src/init.el → /a/b/src/**"
  (concat (string-remove-suffix "/" (file-name-directory resource)) "/**"))

(defun jf/gptel-scope--current-chat-buffer ()
  "Return the chat buffer associated with the active expansion, or nil.
Reads `:chat-buffer' from the transient scope plist captured at
expansion-trigger time. Falls back to `(current-buffer)' when no transient
scope is available (defensive — production callers always go through the
transient).  Returns nil when the captured buffer has been killed."
  (let* ((scope (and (fboundp 'transient-scope) (transient-scope)))
         (buffer (or (and scope (plist-get scope :chat-buffer))
                     (current-buffer))))
    (and (bufferp buffer) (buffer-live-p buffer) buffer)))

(defun jf/gptel-scope--write-pattern-to-scope (pattern validation-type tool denied-operation)
  "Route PATTERN to the drawer writer based on VALIDATION-TYPE.
TOOL is the tool name (passed for diagnostic context only).
DENIED-OPERATION is the operation keyword from the validation error
(e.g. :read, :write) collapsed by the writer to the matching drawer key
via `jf/gptel-scope--map-operation-to-drawer-key'.

Returns the result of the underlying drawer writer (the pattern string
when the buffer was modified, nil on dedup short-circuit, or nil on the
bare-command branch of bash routing — see `--add-bash-to-scope')."
  (pcase validation-type
    ('path
     (jf/gptel-scope--add-path-to-scope pattern tool denied-operation))
    ('bash
     (jf/gptel-scope--add-bash-to-scope pattern tool denied-operation))
    (_
     (user-error "Unknown validation type: %s" validation-type))))

(defun jf/gptel-scope--map-operation-to-drawer-key (operation)
