config/gptel/scope/scope-expansion.org
** Map Operation to Drawer Key

Closed-set collapse from a granular validator-pipeline / bash-parser
=:operation= keyword to one of five list-shaped drawer keys (=READ= /
=READ_METADATA= / =WRITE= / =MODIFY= / =EXECUTE=). The bare form is
returned (no surrounding colons) because Org's =org-entry-*= property API
takes the bare key; the colonised =:GPTEL_SCOPE_READ:= literal appears
only in the drawer text.

The input domain is the ten =:operation= values declared by
=register/vocabulary/operation-to-drawer-key=. Adding a value here that
isn't in the entry is a vocabulary-mismatch finding; adding a value to the
entry without updating this collapse is the same. =GPTEL_SCOPE_DENY= is
*not* a collapse target — it's expressed at the action layer (=add-to-
deny-scope=), not as an =:operation= input.

*Cycle-2 disposition history*:

- *Ask 10A* (=:read-metadata=): a metadata stat (=[ -f file ]=,
  =stat=, =which=) carries enough power to enumerate filesystem layout
  but not to read content; collapsing it into =GPTEL_SCOPE_READ= would
  silently grant content reads on every metadata add-to-scope. We split
  =:read-metadata= into its own =GPTEL_SCOPE_READ_METADATA= bucket;
  validator-side acceptance against =:paths.read-metadata= patterns is
  wired in =rewire-validator-config-load=.
- *Ask 10B* (=:match-pattern=): the bash-parser emits =:match-pattern=
  with the literal pattern (=*.txt=) as =:resource=; routing the pattern
  into a path-allowlist drawer key would grant reads on every filesystem
  match. The action handler is responsible for redirecting
  =:match-pattern= to the sibling =:read-directory= operation BEFORE the
  writer is called. If =:match-pattern= reaches this function, that
  redirect failed and we error loudly so the defect surfaces immediately.
- *Ask 10C* (=:delete=): kept under =GPTEL_SCOPE_WRITE= rather than its
  own bucket. The disposition decision is recorded inline so a future
  reader doesn't re-litigate the question.

This is the structural analogue of
=jf/gptel-scope--map-operation-to-scope-section= (under § Add Path to
Scope) — same collapsing logic, returning a drawer-key string instead of a
plist key. Both must stay in lockstep; any new bash-parser semantic op type
must be added here, in the validator-pipeline mapper, and to
=register/vocabulary/operation-to-drawer-key= in the same change.

*Unmapped policy: error.* Earlier drafts collapsed unmapped operations
(typos, =nil=, future bash-parser ops) silently to =GPTEL_SCOPE_READ=. That
inverts the fail-safe direction: =GPTEL_SCOPE_READ= is an *allowlist* —
adding to it *grants* read access. The strict-error fallback forces the
typo / nil-operation case to surface at the user-visible expansion UI the
moment it happens, rather than silently bloating =GPTEL_SCOPE_READ=. For
violations that legitimately arrive with =:operation nil= (cloud-auth,
parse-incomplete), the upstream fix lives at the =--add-to-scope= action
handler (which should refuse to run on nil-operation bash violations and
prompt the user with a different action).

#+begin_src emacs-lisp
(defun jf/gptel-scope--map-operation-to-drawer-key (operation)
  "Map a denied OPERATION keyword to the matching drawer key string.

The input domain is the ten `:operation' values declared by
`register/vocabulary/operation-to-drawer-key' (read-like collapse to
GPTEL_SCOPE_READ; `:read-metadata' → GPTEL_SCOPE_READ_METADATA;
write-like collapse to GPTEL_SCOPE_WRITE; `:modify' → MODIFY;
`:execute' → EXECUTE).  Returns the bare key form (e.g.
\"GPTEL_SCOPE_READ\") suitable for the `org-entry-*' property API; the
colonised drawer literal \":GPTEL_SCOPE_READ:\" only appears in drawer
text.

Signals an error on any operation outside the closed input set, including
nil and `:match-pattern' — silent fall-through would grant read access on
every typo or upstream nil-operation case, and routing a glob pattern
into GPTEL_SCOPE_READ would grant reads on every filesystem match.
Callers receiving violations with `:operation nil' (cloud-auth,
parse-incomplete) or `:match-pattern' must intercept at the action layer
rather than relying on this function to choose a default — see
`harden-add-to-scope-action-handler' (cycle-3)."
  (cond
   ;; Read-like ops — :read-directory still collapses to READ since the
   ;; whole directory is the resource and granting it as a read scope is
   ;; the user's intent. :read-metadata gets its own bucket per ask 10A.
   ((memq operation '(:read :read-directory))
    "GPTEL_SCOPE_READ")
   ((eq operation :read-metadata)
    "GPTEL_SCOPE_READ_METADATA")
   ;; Write-like ops — :delete is intentionally kept under WRITE rather
   ;; than getting its own bucket (cycle-2 ask 10C disposition).
   ((memq operation '(:write :create :create-or-modify :append :delete))
    "GPTEL_SCOPE_WRITE")
   ((eq operation :modify)  "GPTEL_SCOPE_MODIFY")
   ((eq operation :execute) "GPTEL_SCOPE_EXECUTE")
   ;; Action-handler-only operations.  :match-pattern (cycle-2 ask 10B)
   ;; must be redirected to its sibling :read-directory before reaching
   ;; the writer; if it lands here, the upstream redirect is broken.
   ((eq operation :match-pattern)
    (error "scope-expansion: :match-pattern reached the writer — action handler should have redirected to :read-directory"))
   ((null operation)
    (error "scope-expansion: cannot map nil :operation to a drawer key — handle at the action layer"))
   (t
    (error "scope-expansion: unmapped :operation %S — extend the mapping or use the deny action"
           operation))))
#+end_src

** Write Pattern to Drawer

Append =PATTERN= to =BUFFER='s drawer key for =OPERATION= and persist via
=save-buffer=. Idempotent: returns =nil= and leaves the buffer
byte-for-byte unchanged when =PATTERN= is already present under the target
key (no =save-buffer= call, no spurious entry in the user's undo ring).
Returns =PATTERN= when the buffer was modified.

Uses =org-entry-put-multivalued-property= against point-min so the
file-level drawer is targeted (matching the reader's positioning). The
helper writes the bare key for the first value and =KEY+:= continuation
lines for subsequent values, preserving the single-drawer invariant. The
drawer must already exist; for sessions created by
=jf/gptel-scope-profile--apply-to-drawer= this is true.

#+begin_src emacs-lisp
(defun jf/gptel-scope--write-pattern-to-drawer (buffer operation pattern)
  "Append PATTERN to BUFFER's drawer key for OPERATION; save the buffer.
Idempotent: returns nil and does not modify the buffer when PATTERN is
already present under the target key. Returns the pattern string when the
buffer was modified.

OPERATION is collapsed to a drawer key via
`jf/gptel-scope--map-operation-to-drawer-key'.  The drawer at point-min
must already exist; this is true for any session created by
`jf/gptel-scope-profile--apply-to-drawer'."
  (with-current-buffer buffer
    (save-excursion
      (save-restriction
        (widen)
        (goto-char (point-min))
        (let* ((key (jf/gptel-scope--map-operation-to-drawer-key operation))
               (existing (org-entry-get-multivalued-property (point) key)))
          (if (member pattern existing)
              nil
            (let ((updated (append existing (list pattern))))
              (apply #'org-entry-put-multivalued-property
                     (point) key updated)
              (save-buffer)
              pattern)))))))
#+end_src

* Transient Menu

The main UI for handling scope violations.

#+begin_src emacs-lisp
(transient-define-prefix jf/gptel-scope-expansion-menu ()
  "Handle scope violation with 3-choice UI."
  [:description
   (lambda ()
     (let* ((scope (transient-scope))
            (violation (plist-get scope :violation))
            (tool (plist-get violation :tool))
            (resource (plist-get violation :resource))
            (reason (plist-get violation :reason))
            (metadata (plist-get violation :metadata))
            (git-tracked (when metadata (plist-get metadata :git-tracked)))
            (exists (when metadata (plist-get metadata :exists))))
       (concat
        (format "Scope Violation: %s\n  Tool: %s\n  Resource: %s"
                (propertize "Access Denied" 'face 'error)
                (propertize tool 'face 'font-lock-function-name-face)
                (propertize resource 'face 'font-lock-string-face))
        ;; Display git status if metadata available
        (when metadata
          (format "\n  Git Status: %s"
                  (propertize (if git-tracked "TRACKED" "NOT TRACKED")
                              'face (if git-tracked 'success 'warning))))
        ;; Display file status if metadata available
        (when metadata
          (format "\n  File Status: %s"
                  (propertize (if exists "exists" "does not exist")
                              'face (if exists 'success 'warning))))
        ;; Display reason if present (defensive: handle nil gracefully)
        (when reason
          (format "\n  Reason: %s"
                  (propertize reason 'face 'warning))))))
   [("d" "Deny (reject tool call)" jf/gptel-scope--deny-expansion
     :transient nil)
    ("a" "Add to scope (permanent)" jf/gptel-scope--add-to-scope
     :transient nil)
    ("w" (lambda ()
           (let* ((resource (plist-get (plist-get (transient-scope) :violation) :resource))
                  (pattern (jf/gptel-scope--parent-wildcard-for resource)))
             (format "Add %s to scope" pattern)))
     jf/gptel-scope--add-wildcard-to-scope
     :if (lambda ()
           (not (file-directory-p
                 (plist-get (plist-get (transient-scope) :violation) :resource))))
     :transient nil)
    ("c" "Add custom pattern to scope" jf/gptel-scope--add-custom-to-scope
     :transient nil)
    ("o" "Allow once (temporary)" jf/gptel-scope--allow-once-action
     :transient nil)]
   [""
    ("e" "Edit scope manually" jf/gptel-scope--edit-scope)
    ("q" "Cancel" transient-quit-one)]])
#+end_src

