config/gptel/scope/scope-expansion.org
* Expansion Actions

Functions called by the transient menu choices.

** Deny Expansion

#+begin_src emacs-lisp
(defun jf/gptel-scope--deny-expansion ()
  "Reject the tool call completely."
  (interactive)
  (condition-case err
      (let* ((scope (transient-scope))
             (callback (plist-get scope :callback)))
        (if callback
            (condition-case callback-err
                (funcall callback
                         (json-serialize
                          (list :success nil
                                :user_denied t
                                :message "User denied scope expansion request.")))
              (error
               (message "Error invoking callback: %s" (error-message-string callback-err))))
          (message "Warning: No callback provided for scope expansion"))
        (transient-quit-one)
        (jf/gptel-scope--process-expansion-queue))
    (error
     (message "Error in deny-expansion: %s" (error-message-string err))
     (transient-quit-one)
     (jf/gptel-scope--process-expansion-queue))))
#+end_src

** Add to Scope

#+begin_src emacs-lisp
(defun jf/gptel-scope--add-to-scope ()
  "Add violated resource to the chat buffer's scope drawer permanently."
  (interactive)
  (let* ((scope (transient-scope))
         (violation (plist-get scope :violation))
         (callback (plist-get scope :callback))
         (validation-type (plist-get violation :validation-type))
         (resource (plist-get violation :resource))
         (tool (plist-get violation :tool))
         (denied-operation (plist-get violation :operation)))

    ;; Route to the drawer writer. denied-operation is collapsed to a
    ;; :GPTEL_SCOPE_<KEY>: drawer key by --map-operation-to-drawer-key.
    (jf/gptel-scope--write-pattern-to-scope resource validation-type tool denied-operation)

    ;; Notify callback with JSON response
    (condition-case err
        (if callback
            (let* ((patterns (plist-get scope :patterns))
                   (tool-name (plist-get scope :tool-name)))
              (funcall callback
                       (json-serialize
                        (list :success t
                              :patterns_added (vconcat patterns)  ; Convert list to vector for JSON array
                              :message (format "Scope expanded. Added %d pattern(s) to %s"
                                             (length patterns) tool-name)))))
          (message "Warning: No callback provided for scope expansion"))
      (error
       (message "Error invoking callback: %s" (error-message-string err))))

    (message "Added %s to scope" resource)
    (transient-quit-one)
    (jf/gptel-scope--process-expansion-queue)))
#+end_src

** Allow Once Action

#+begin_src emacs-lisp
(defun jf/gptel-scope--allow-once-action ()
  "Authorize the pending tool invocation without modifying the scope drawer.
Signals success to the wrapper's callback. The wrapper treats this the
same as a passed validation and runs the tool body once. No state is
persisted — a subsequent invocation of the same resource will prompt
again."
  (interactive)
  (let* ((scope (transient-scope))
         (violation (plist-get scope :violation))
         (callback (plist-get scope :callback))
         (resource (plist-get violation :resource)))
    (condition-case err
        (if callback
            (funcall callback
                     (json-serialize
                      (list :success t
                            :allowed_once t
                            :message "Permission granted for this invocation only.")))
          (message "Warning: No callback provided for scope expansion"))
      (error
       (message "Error invoking callback: %s" (error-message-string err))))

    (message "Allowed %s once" resource)
    (transient-quit-one)
    (jf/gptel-scope--process-expansion-queue)))
#+end_src

** Add Wildcard to Scope

#+begin_src emacs-lisp
(defun jf/gptel-scope--add-wildcard-to-scope ()
  "Add parent-directory wildcard pattern to the scope drawer permanently."
  (interactive)
  (let* ((scope (transient-scope))
         (violation (plist-get scope :violation))
         (callback (plist-get scope :callback))
         (validation-type (plist-get violation :validation-type))
         (resource (plist-get violation :resource))
         (tool (plist-get violation :tool))
         (denied-operation (plist-get violation :operation))
         (pattern (jf/gptel-scope--parent-wildcard-for resource)))

    (jf/gptel-scope--write-pattern-to-scope pattern validation-type tool denied-operation)

    (condition-case err
        (if callback
            (funcall callback
                     (json-serialize
                      (list :success t
                            :patterns_added (vector pattern)
                            :message (format "Scope expanded. Added wildcard %s" pattern))))
          (message "Warning: No callback provided for scope expansion"))
      (error
       (message "Error invoking callback: %s" (error-message-string err))))

    (message "Added %s to scope" pattern)
    (transient-quit-one)
    (jf/gptel-scope--process-expansion-queue)))
#+end_src

** Add Custom Pattern to Scope

#+begin_src emacs-lisp
(defun jf/gptel-scope--add-custom-to-scope ()
  "Prompt for a custom pattern and add it to the scope drawer permanently."
  (interactive)
  (let* ((scope (transient-scope))
         (violation (plist-get scope :violation))
         (callback (plist-get scope :callback))
         (validation-type (plist-get violation :validation-type))
         (resource (plist-get violation :resource))
         (tool (plist-get violation :tool))
         (denied-operation (plist-get violation :operation))
         (custom-pattern (condition-case nil
                             (read-string (format "Add pattern [%s]: " resource) resource)
                           (quit nil))))

    (if (null custom-pattern)
        ;; User pressed C-g — deny without error
        (condition-case err
            (if callback
                (funcall callback
                         (json-serialize
                          (list :success nil
                                :user_denied t)))
              (message "Warning: No callback provided for scope expansion"))
          (error
           (message "Error invoking callback: %s" (error-message-string err))))

      ;; User provided a pattern — write it
      (jf/gptel-scope--write-pattern-to-scope custom-pattern validation-type tool denied-operation)

      (condition-case err
          (if callback
              (funcall callback
                       (json-serialize
                        (list :success t
                              :patterns_added (vector custom-pattern)
                              :message (format "Scope expanded. Added custom pattern %s" custom-pattern))))
            (message "Warning: No callback provided for scope expansion"))
        (error
         (message "Error invoking callback: %s" (error-message-string err))))

      (message "Added %s to scope" custom-pattern))

    (transient-quit-one)
    (jf/gptel-scope--process-expansion-queue)))
#+end_src

** Edit Scope Manually

The "Edit Manually" action surfaces the live chat buffer's =session.org=
to the user — the same file the validator reads. We bring it into focus,
point at =point-min=, unfold the =:PROPERTIES:= drawer if collapsed, then
quit the transient.

#+begin_src emacs-lisp
(defun jf/gptel-scope--edit-scope ()
  "Bring the chat buffer's session.org into focus and unfold the
:PROPERTIES: drawer at point-min, then quit the transient."
  (interactive)
  (let ((buffer (jf/gptel-scope--current-chat-buffer)))
    (unless buffer
      (user-error "No chat buffer associated with this expansion"))
    (switch-to-buffer buffer)
    (goto-char (point-min))
    (when (looking-at-p "^[ \t]*:PROPERTIES:[ \t]*$")
      (org-cycle))
    (transient-quit-one)))
#+end_src

* Scope Updaters

Per-validation-type wrappers around =--write-pattern-to-drawer=.  Path
validations write directly; bash validations route path-shaped resources
to the writer and emit a user message for bare command names (which are
not expandable in the operation-first model).

