config/gptel/scope/scope-expansion.el
  "Add PATH to the chat buffer's scope drawer.
TOOL is passed for diagnostic context only (the writer routes by
DENIED-OPERATION, not by tool category).
DENIED-OPERATION is the operation keyword from the validation error
(e.g., :read, :read-metadata, :write). The drawer writer collapses it
to the matching :GPTEL_SCOPE_<KEY>: drawer key via
`jf/gptel-scope--map-operation-to-drawer-key'.

When DENIED-OPERATION is nil, defaults to :read (the safest choice for
filesystem tools whose category the caller did not pass through).
Returns the result of the underlying writer (the pattern when the
buffer was modified, nil on dedup short-circuit)."
  (ignore tool)
  (let* ((operation (or denied-operation :read))
         ;; Trailing-slash → /** suffix preserves the v3 normalization
         ;; behavior (a directory grant means \"this dir and below\").
         (normalized-path (if (string-suffix-p "/" path)
                              (concat (directory-file-name path) "/**")
                            path))
         (buffer (jf/gptel-scope--current-chat-buffer)))
    (unless buffer
      (user-error "No chat buffer associated with this expansion"))
    (jf/gptel-scope--write-pattern-to-drawer buffer operation normalized-path)))

(defun jf/gptel-scope--add-bash-to-scope (resource tool &optional denied-operation)
  "Add bash command RESOURCE to the chat buffer's scope drawer.
TOOL is passed for diagnostic context only.
DENIED-OPERATION, when non-nil, is the denied operation keyword (e.g.,
:read-metadata) collapsed by the writer to the matching drawer key.

Path-shaped RESOURCE values (absolute, tilde-prefixed, glob, or directory)
delegate to `jf/gptel-scope--add-path-to-scope'. Bare command names
emit a user message and return nil — they are not expandable in the
operation-first model."
  ;; Check if resource is a path-like pattern or a bare command name.
  ;; Path-like: absolute (/..., ~...), directory, or contains a glob wildcard
  ;; (match-pattern operations produce globs like "*.txt").
  ;; Command patterns are bare names like "brew" or "tree" — not expandable.
  (if (or (file-directory-p resource)
          (string-prefix-p "/" resource)
          (string-prefix-p "~" resource)
          (string-match-p "[*?]" resource))
      (jf/gptel-scope--add-path-to-scope resource tool denied-operation)

    ;; Bare command name — not expandable in the operation-first model
    ;; (commands are validated by their file operations, not by name).
    (message "Cannot add command '%s' to scope — use path-based expansion instead" resource)
    nil))

(defun jf/gptel-scope-prompt-expansion (violation-info callback patterns tool-name)
  "Show expansion UI for VIOLATION-INFO, or queue if one is already active.
CALLBACK is the gptel async callback to invoke with JSON result.
PATTERNS is the list of patterns to add if approved.
TOOL-NAME is the tool requesting expansion.
VIOLATION-INFO is a plist with :tool, :resource, :reason, :validation-type.

The current buffer is captured at expansion-trigger time and stored on
the transient scope plist as `:chat-buffer'.  Action handlers retrieve
it via `jf/gptel-scope--current-chat-buffer' and mutate the chat
buffer's `:PROPERTIES:' drawer in place — the writer no longer round-
trips through a YAML file.

When multiple async tools trigger expansion simultaneously (via gptel's mapc),
the first call shows the transient immediately and subsequent calls are queued.
After the user responds to each prompt, `jf/gptel-scope--process-expansion-queue'
shows the next queued prompt or clears the active flag.

This is a public API function used by scope-shell-tools and other modules."
  (let ((chat-buffer (current-buffer)))
    (if jf/gptel-scope--expansion-active
        ;; Queue this prompt — a transient is already showing
        (setq jf/gptel-scope--expansion-queue
              (append jf/gptel-scope--expansion-queue
                      (list (list :violation violation-info
                                  :callback callback
                                  :patterns patterns
                                  :tool-name tool-name
                                  :chat-buffer chat-buffer))))
      ;; No active expansion — show transient immediately
      (setq jf/gptel-scope--expansion-active t)
      (transient-setup 'jf/gptel-scope-expansion-menu nil nil
                       :scope (list :violation violation-info
                                    :callback callback
                                    :patterns patterns
                                    :tool-name tool-name
                                    :chat-buffer chat-buffer)))))

(provide 'jf-gptel-scope-expansion)
;;; scope-expansion.el ends here
